In [60]:
import pandas as pd

In [61]:
people = {
    "first": ["Corey", 'Jane', 'John'], 
    "last": ["Schafer", 'Doe', 'Doe'], 
    "email": ["CoreyMSchafer@gmail.com", 'JaneDoe@email.com', 'JohnDoe@email.com']
}
df=pd.DataFrame(people)

In [62]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

##### How to combine two columns together?

In [63]:
# We can simply concatenate them 
df["first"]+" "+df["last"]

0    Corey Schafer
1         Jane Doe
2         John Doe
dtype: object

##### How to add columns?

In [64]:
df["full_name"]=df["first"]+" "+df["last"]

In [65]:
df

   first     last                    email      full_name
0  Corey  Schafer  CoreyMSchafer@gmail.com  Corey Schafer
1   Jane      Doe        JaneDoe@email.com       Jane Doe
2   John      Doe        JohnDoe@email.com       John Doe

##### How to remove columns?

In [66]:
# we can reomve columns using the drop method
df.drop(columns=["first","last"],inplace=True)

In [67]:
df

                     email      full_name
0  CoreyMSchafer@gmail.com  Corey Schafer
1        JaneDoe@email.com       Jane Doe
2        JohnDoe@email.com       John Doe

In [68]:
# Lets do now the opposite which means splitting the first and last in two columns:
df["full_name"].str.split(" ",expand=True)

       0        1
0  Corey  Schafer
1   Jane      Doe
2   John      Doe

In [69]:
df[["first","last"]]=df["full_name"].str.split(" ",expand=True)

In [70]:
df

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe

##### Adding and removing rows:

##### How to add a single row:
- There are different way how we add rows to our dataframe
- We can add a single row using the append() method
- Maybe we want to combine two dataframes togther

In [71]:
# Adding a single row of data

In [72]:
# append() has been changed to _append()
df._append({"first":"Tony"},ignore_index=True)

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe
3                      NaN            NaN   Tony      NaN

In [73]:
# Lets create a new dataframe
people2 = {
    "first": ["Sam","Jordan"], 
    "last": ["Strak","Mccorney"], 
    "email": ["samjordan@gmail.com" , "starkmccorney@gmx.com"]
}
df2=pd.DataFrame(people2)

In [74]:
df2

    first      last                  email
0     Sam     Strak    samjordan@gmail.com
1  Jordan  Mccorney  starkmccorney@gmx.com

##### Lets add two dataframes togehter:

In [75]:
df._append(df2,ignore_index=True)

                     email      full_name   first      last
0  CoreyMSchafer@gmail.com  Corey Schafer   Corey   Schafer
1        JaneDoe@email.com       Jane Doe    Jane       Doe
2        JohnDoe@email.com       John Doe    John       Doe
3      samjordan@gmail.com            NaN     Sam     Strak
4    starkmccorney@gmx.com            NaN  Jordan  Mccorney

In [76]:
# To make this change permenant I can assign the result to df (I have no inplce here!)
df=df._append(df2,ignore_index=True)

In [77]:
df

                     email      full_name   first      last
0  CoreyMSchafer@gmail.com  Corey Schafer   Corey   Schafer
1        JaneDoe@email.com       Jane Doe    Jane       Doe
2        JohnDoe@email.com       John Doe    John       Doe
3      samjordan@gmail.com            NaN     Sam     Strak
4    starkmccorney@gmx.com            NaN  Jordan  Mccorney

In [78]:
# How to remove a row of my df:
# We just input the number of the index
df.drop(index=4,inplace=True)

In [79]:
df

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe
3      samjordan@gmail.com            NaN    Sam    Strak

In [80]:
# We can drop using a filter to my index
filt=(df["last"]=="Doe")
df[filt]

               email full_name first last
1  JaneDoe@email.com  Jane Doe  Jane  Doe
2  JohnDoe@email.com  John Doe  John  Doe

In [81]:
# I want to get the index of these
index_to_drop=df[filt].index

In [82]:
# Now lets use drop function
df.drop(index=index_to_drop)

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
3      samjordan@gmail.com            NaN    Sam    Strak